someone42/hardware-bitcoin-wallet/pic32/usb_hal.c
/** \file usb_hal.c
  *
  * \brief Hardware abstraction layer for PIC32 USB module.
  *
  * This file provides an abstract interface for USB operations on the PIC32
  * USB module. It is quite simple and doesn't support many features.
  * The PIC32 USB module supports "ping-pong buffering" (double buffering),
  * but this implementation does not use this feature, as throughput is not
  * expected to be a concern. Furthermore, this doesn't support USB suspend or
  * resume.
  *
  * From a device's perspective, USB transactions are asynchronous. That is
  * because the host tells the device when it can transmit or receive.
  * Therefore, transmission and reception functions are implemented through
  * an asynchronous interface involving per-endpoint callback functions defined
  * in the #EndpointState structure.
  *
  * All references to the "USB specification" refer to revision 2.0, obtained
  * from http://www.usb.org/developers/docs/usb_20_110512.zip (see usb_20.pdf)
  * on 26 March 2012. All references to the "PIC32 Family Reference Manual"
  * refer to section 27, revision F, obtained from
  * http://ww1.microchip.com/downloads/en/DeviceDoc/61126F.pdf
  * on 6 November 2012.
  *
  * This file is licensed as described by the file LICENCE.
  */

#include <stdint.h>
#include <stdbool.h>
#include <string.h>
#include <p32xxxx.h>
#include "usb_hal.h"
#include "usb_defs.h"
#include "usb_callbacks.h"
#include "usb_standard_requests.h" // for usbResetSeen() callback
#include "pic32_system.h"

/** Each endpoint has 4 buffer descriptor entries: even receive, odd receive,
  * even transmit and odd transmit. The even/odd buffers allow for double
  * buffering. This macro generates a readable index into #bdt_table. For
  * dir, use #BDT_RX or #BDT_TX. For pp, use #BDT_EVEN or #BDT_ODD. */
#define BDT_IDX(endpoint, dir, pp)	((((endpoint) & 15) << 2) \
									| (((dir) & 1) << 1) \
									| ((pp) & 1))
/** Value for dir parameter of #BDT_IDX macro which is used to access the
  * receive descriptors. */
#define BDT_RX						0
/** Value for dir parameter of #BDT_IDX macro which is used to access the
  * transmit descriptors. */
#define BDT_TX						1
/** Value for pp parameter of #BDT_IDX macro which is used to access the
  * even descriptors. */
#define BDT_EVEN					0
/** Value for pp parameter of #BDT_IDX macro which is used to access the
  * odd descriptors. */
#define BDT_ODD						1

/** Because stdlib.h might not be included, NULL might be undefined. NULL
  * is used in #endpoint_states to signify that no state structure has
  * been supplied. */
#ifndef NULL
#define NULL ((void *)0)
#endif // #ifndef NULL

/** USB module buffer descriptor format, as described in section 27.3.5.3.4
  * ("Buffer Descriptor Format") of the PIC32 family reference manual. */
typedef union __attribute__((__packed__)) USBBufferDescriptorStruct
{
	/** Interpretation when handing descriptor to USB module. */
	struct __attribute__((__packed__))
	{
		unsigned int reserved1	: 2;
		/** Set to 1 to issue stall handshake when buffer is used. */
		unsigned int BSTALL		: 1;
		/** Set to 1 to enable checking of data toggle sequence bit. */
		unsigned int DTS		: 1;
		/** Set to 1 to stop DMA from auto-incrementing address. */
		unsigned int NINC		: 1;
		/** Set to 1 to tell USB module to keep the buffer forever. */
		unsigned int KEEP		: 1;
		/** Value of data toggle sequence to use (only if #DTS is 1). */
		unsigned int DATA0_1	: 1;
		/** 0 = owned by CPU, 1 = owned by USB module. */
		unsigned int UOWN		: 1;
		unsigned int reserved2	: 8;
		/** Bytes to send (if transmitting) or maximum number of bytes to
		  * receive (if receiving). */
		unsigned int BYTE_COUNT	: 10;
		unsigned int reserved3	: 6;
		/** Physical address of packet buffer. */
		uint32_t BUFFER_ADDRESS;
	} CTRL;

	/** Interpretation when getting descriptor from USB module. */
	struct __attribute__((__packed__))
	{
		unsigned int reserved1	: 2;
		/** Packet identifier of token packet. */
		unsigned int PID		: 4;
		/** Value of data toggle sequence bit of transacted packet. */
		unsigned int DATA0_1	: 1;
		/** 0 = owned by CPU, 1 = owned by USB module. */
		unsigned int UOWN		: 1;
		unsigned int reserved2	: 8;
		/** Actual number of bytes sent or received. */
		unsigned int BYTE_COUNT	: 10;
		unsigned int reserved3	: 6;
		/** Physical address of packet buffer. */
		uint32_t BUFFER_ADDRESS;
	} STATUS;
} USBBufferDescriptor;

/** USB module buffer descriptor table. To calculate an index into this table,
  * use the #BDT_IDX macro.
  * \warning Due to the way the USB module works, this must be aligned to a
  *          multiple of 512 bytes.
  */
static USBBufferDescriptor bdt_table[NUM_ENDPOINTS * 4] __attribute__((aligned(512)));

/** Array of endpoint state pointers. NULL means no state. This is accessed by
  * the interrupt service routine whenever a successful transaction occurs. */
static EndpointState *endpoint_states[NUM_ENDPOINTS];

/** Resets the USB HAL state. This doesn't reset as much as usbInit(), but
  * resets everything appropriate to a USB protocol reset (as defined in
  * section 7.1.7.5 of the USB specification). */
static void usbHALReset(void)
{
	unsigned int endpoint;

	U1ADDRbits.DEVADDR = 0; // default to device address = 0
	// Reset all data sequence bits.
	for (endpoint = 0; endpoint < NUM_ENDPOINTS; endpoint++)
	{
		if (endpoint_states[endpoint] != NULL)
		{
			endpoint_states[endpoint]->data_sequence = 0;
		}
	}
	usbResetSeen();
}

/** Initialise USB module. */
void usbInit(void)
{
	unsigned int i;
	uint32_t bdt_base_address;

	// Initialise buffer descriptor table.
	memset(bdt_table, 0, sizeof(bdt_table));
	// Enable power to module.
	while (U1PWRCbits.USBBUSY != 0)
	{
		// do nothing
	}
	U1PWRCbits.USBPWR = 1;
	// Tell USB module where the buffer descriptor table is.
	// This throws away the lower 9 bits of the base address (that's why the
	// table needs to be aligned to a multiple of 512 bytes).
	bdt_base_address = VIRTUAL_TO_PHYSICAL(bdt_table);
	U1BDTP1bits.BDTPTRL = ((bdt_base_address >> 9) & 0x7f);
	U1BDTP2bits.BDTPTRH = ((bdt_base_address >> 16) & 0xff);
	U1BDTP3bits.BDTPTRU = ((bdt_base_address >> 24) & 0xff);
	// Initialise other features of USB module.
	U1OTGIE = 0; // disable OTG interrupts
	U1OTGIR = 0xfd; // clear all pending OTG interrupts
	U1PWRCbits.USLPGRD = 0; // no sleep guard
	U1PWRCbits.USUSPEND = 0; // disable suspend mode
	U1OTGCON = 0; // disable OTG mode
	U1IE = 0;
	U1IEbits.URSTIE = 1; // enable USB reset interrupt
	U1IEbits.UERRIE = 1; // enable USB error interrupt
	U1IEbits.TRNIE = 1; // enable token processing complete interrupt
	U1IR = 0xff; // clear all pending USB interrupts
	U1EIE = 0xff; // enable all USB error interrupts
	U1EIR = 0xff; // clear all pending USB error interrupts
	U1CONbits.PKTDIS = 0; // enable packet processing
	U1CONbits.HOSTEN = 0; // device mode
	U1CONbits.RESUME = 0; // don't send RESUME signal
	U1CONbits.PPBRST = 1; // reset ping-pong buffer pointers to EVEN
	U1ADDRbits.LSPDEN = 0; // full-speed mode
	U1ADDRbits.DEVADDR = 0; // default to device address = 0
	U1CNFG1 = 0; // disable USB test mode features
	for (i = 0; i < NUM_ENDPOINTS; i++)
	{
		usbDisableEndpoint(i);
	}
	// Configure interrupt controller for USB interrupts.
	IPC11bits.USBIP = 2; // priority level = 2
	IPC11bits.USBIS = 0; // sub-priority level = 0
	IFS1bits.USBIF = 0; // clear interrupt flag
	IEC1bits.USBIE = 1; // enable interrupt
}

/** Signal USB connect to host. */
void usbConnect(void)
{
	U1CONbits.USBEN = 1; // enable module
}

/** Signal USB disconnect to host. */
void usbDisconnect(void)
{
	U1CONbits.USBEN = 0; // disable module
	usbHALReset();
}

