someone42/hardware-bitcoin-wallet/pic32/usb_hal.c
/** Handoff receive buffer of the appropriate endpoint state to the USB
  * module, so that it is ready to receive another packet. This must be called
  * after receiving a packet, otherwise subsequent packets will be NAKed.
  * \param endpoint The device endpoint number.
  */
void usbQueueReceivePacket(unsigned int endpoint)
{
	unsigned int index;
	uint8_t *packet_buffer;
	uint32_t length;

	if (endpoint >= NUM_ENDPOINTS)
	{
		// Bad endpoint number.
		usbFatalError();
		return;
	}
	if (endpoint_states[endpoint] == NULL)
	{
		// Attempting to access non-existent state.
		usbFatalError();
		return;
	}
	index = BDT_IDX(endpoint, BDT_RX, BDT_EVEN);
	if (bdt_table[index].CTRL.UOWN != 0)
	{
		// Attempting to overwrite another queued receive.
		usbFatalError();
		return;
	}
	packet_buffer = endpoint_states[endpoint]->receive_buffer;
	length = sizeof(endpoint_states[endpoint]->receive_buffer);
	// Set buffer parameters.
	bdt_table[index].CTRL.BSTALL = 0;
	// Data sequence checking is done in software. This is because SETUP
	// transactions need to be handled specially.
	bdt_table[index].CTRL.DTS = 0;
	bdt_table[index].CTRL.NINC = 0;
	bdt_table[index].CTRL.KEEP = 0;
	bdt_table[index].CTRL.DATA0_1 = endpoint_states[endpoint]->data_sequence;
	bdt_table[index].CTRL.BYTE_COUNT = length;
	bdt_table[index].CTRL.BUFFER_ADDRESS = VIRTUAL_TO_PHYSICAL(packet_buffer);
	// Tell USB module to process buffer.
	bdt_table[index].CTRL.UOWN = 1;
}

/** Interrupt service handler for USB interrupts. */
void __attribute__((vector(_USB_1_VECTOR), interrupt(ipl2), nomips16)) _USBHandler(void)
{
	unsigned int endpoint;
	unsigned int direction;
	bool is_setup;
	bool is_extended;
	EndpointState *state;
	uint32_t index;
	uint32_t length;
	uint32_t transmitted_bytes;

	usbActivityLED();
	U1CONbits.PPBRST = 1; // reset ping-pong buffer pointers to EVEN
	// Determine cause of interrupt.
	if (U1IRbits.TRNIF != 0)
	{
		// Packet transmitted or received.
		// Clearing TRNIF advances the U1STAT FIFO (see Note 1 of Register
		// 27-10 in the PIC32 family reference manual). Therefore U1STAT must
		// be read before clearing TRNIF.
		endpoint = U1STATbits.ENDPT;
		if (endpoint >= NUM_ENDPOINTS)
		{
			// Bad endpoint number.
			usbFatalError();
			return;
		}
		direction = U1STATbits.DIR;
		// TRNIF needs to be cleared before the next transaction, otherwise
		// an interrupt could be missed. Fourtunately, the minimum time for a
		// valid 0-length data transaction is 32 + 3 + 32 + 3 + 16 + 3 bit
		// periods (token + data + handshake), or 534 cycles at 72 MHz. That's
		// plenty of time, however, TRNIF should still be cleared before
		// doing any packet processing.
		U1IRbits.TRNIF = 1; // clear interrupt flag in USB module
		IFS1bits.USBIF = 0; // clear interrupt flag in interrupt controller
		state = endpoint_states[endpoint];
		if (state == NULL)
		{
			// Attempting to access non-existent state.
			usbFatalError();
			return;
		}
		if (direction == 0)
		{
			// Last transaction was receive.
			index = BDT_IDX(endpoint, BDT_RX, BDT_EVEN);
			length = bdt_table[index].STATUS.BYTE_COUNT;
			is_setup = false;
			if (bdt_table[index].STATUS.PID == USBPID_SETUP)
			{
				is_setup = true;
				// From section 8.5.3 of the USB specification, SETUP
				// transactions always use DATA0.
				state->data_sequence = 0;
			}
			// From section 8.6.4 of the USB specification, if a receiver
			// sees mismatching data toggle sequence bits, it should ACK
			// the packet but ignore its contents. This will result in
			// the transmitter and receiver re-synchronising.
			if (bdt_table[index].STATUS.DATA0_1 == state->data_sequence)
			{
				state->data_sequence ^= 1;
				state->receiveCallback(state->receive_buffer, length, is_setup);
			}
			else
			{
				usbQueueReceivePacket(endpoint);
			}
			if (is_setup)
			{
				// Whenever the USB module sees a SETUP packet, it sets
				// PKTDIS, halting all subsequent packet processing. This
				// gives us the opportunity to safely cancel transactions.
				// PKTDIS needs to be cleared, after processing the SETUP
				// packet, otherwise there will be no further transactions.
				U1CONbits.PKTDIS = 0;
			}
		}
		else
		{
			// Last transaction was transmit.
			state->data_sequence ^= 1;
			if (state->is_extended_transmit)
			{
				index = BDT_IDX(endpoint, BDT_TX, BDT_EVEN);
				transmitted_bytes = bdt_table[index].STATUS.BYTE_COUNT;
				// Advance transmission by transmitted_bytes bytes.
				if (state->transmit_remaining < transmitted_bytes)
				{
					// This should never happen.
					usbFatalError();
				}
				state->transmit_remaining -= transmitted_bytes;
				state->transmit_buffer += transmitted_bytes;
				length = state->transmit_remaining;
				// The idea here is to have every packet except the last be
				// marked as an extended transmit. That way, after the last
				// packet is successfully transmitted, the transmit callback
				// will be called.
				// Note that the comparison below is "<" instead of "<="
				// because the last packet must not be of
				// size MAX_PACKET_SIZE, otherwise the other end doesn't
				// know whether the transmission has finished or not. In
				// those cases, an extra zero-length packet is transmitted
				// to resolve the ambiguity (see section 8.5.3.2 of the
				// USB specification).
				if (length < MAX_PACKET_SIZE)
				{
					is_extended = false;
				}
				else
				{
					is_extended = true;
				}
				usbQueueTransmitPacket(state->transmit_buffer, length, endpoint, is_extended);
			}
			else
			{
				state->transmitCallback();
			}
		}
	}
	else if (U1IRbits.URSTIF != 0)
	{
		// USB reset seen.
		U1IRbits.URSTIF = 1; // clear interrupt flag in USB module
		IFS1bits.USBIF = 0; // clear interrupt flag in interrupt controller
		usbHALReset();
	}
	else if (U1IRbits.UERRIF != 0)
	{
		// USB error.
		U1IRbits.UERRIF = 1; // clear interrupt flag in USB module
		IFS1bits.USBIF = 0; // clear interrupt flag in interrupt controller
		usbFatalError();
	}
	else
	{
		// This should never happen.
		usbFatalError();
	}
}

/** Get the endpoint control register (U1EPx) for the specified endpoint.
  * \param endpoint The device endpoint number.
  * \return Address of the endpoint control register.
  */
static volatile uint32_t *getEndpointControlRegister(unsigned int endpoint)
{
	switch (endpoint)
	{
	case 0:
		return &(U1EP0);
	case 1:
		return &(U1EP1);
	case 2:
		return &(U1EP2);
	case 3:
		return &(U1EP3);
	case 4:
		return &(U1EP4);
	case 5:
		return &(U1EP5);
	case 6:
		return &(U1EP6);
	case 7:
		return &(U1EP7);
	case 8:
		return &(U1EP8);
	case 9:
		return &(U1EP9);
	case 10:
		return &(U1EP10);
	case 11:
		return &(U1EP11);
	case 12:
		return &(U1EP12);
	case 13:
		return &(U1EP13);
	case 14:
		return &(U1EP14);
	case 15:
		return &(U1EP15);
	default:
		// Bad endpoint number.
		usbFatalError();
		return NULL;
	}
}

