someone42/hardware-bitcoin-wallet/pic32/usb_hal.c
/** Disable an endpoint. A disabled endpoint cannot receive or transmit
  * packets. This will also clear any pending I/O.
  * \param endpoint The device endpoint number.
  */
void usbDisableEndpoint(unsigned int endpoint)
{
	uint32_t index;
	volatile uint32_t *reg;

	// Disable transmit/receive for the endpoint.
	if (endpoint >= NUM_ENDPOINTS)
	{
		// Bad endpoint number.
		usbFatalError();
		return;
	}
	reg = getEndpointControlRegister(endpoint);
	*reg = 0;
	// In the worst case, the transmission or reception of a packet could
	// have begun just before "*reg = 0;". To account for this, wait for at
	// least 100 microseconds (greater than the worst-case time for a
	// maximum size transaction) before touching endpoint_states or bdt_table.
	delayCycles(100 * CYCLES_PER_MICROSECOND);
	// It's now safe to modify endpoint_states and bdt_table without worrying
	// about screwing up the interrupt service handler.
	endpoint_states[endpoint] = NULL;
	index = BDT_IDX(endpoint, BDT_RX, BDT_EVEN);
	bdt_table[index].CTRL.UOWN = 0;
	index = BDT_IDX(endpoint, BDT_TX, BDT_EVEN);
	bdt_table[index].CTRL.UOWN = 0;
}

/** Enable endpoint, so that it can begin transmitting and/or receiving.
  * This will automatically call usbQueueReceivePacket() for the endpoint,
  * so it is ready to begin receiving. However, don't forget to call
  * usbQueueReceivePacket() again for each received packet so that
  * subsequent packets can be received.
  * \param endpoint The endpoint number to activate.
  * \param type The type of endpoint (IN, OUT or CONTROL; see #EndpointType).
  * \param state Pointer to buffer which holds per-endpoint state.
  * \warning state must actually be persistent (i.e. do not allocate it on
  *          the stack). This is because it will be accessed by the USB
  *          interrupt service handler.
  */
void usbEnableEndpoint(unsigned int endpoint, EndpointType type, EndpointState *state)
{
	volatile uint32_t *reg;

	if ((state->transmitCallback == NULL) || (state->receiveCallback == NULL))
	{
		// This should never happen.
		usbFatalError();
		return;
	}
	if (endpoint >= NUM_ENDPOINTS)
	{
		// Bad endpoint number.
		usbFatalError();
		return;
	}
	endpoint_states[endpoint] = state;
	state->data_sequence = 0;
	usbQueueReceivePacket(endpoint);
	reg = getEndpointControlRegister(endpoint);
	if (type == IN_ENDPOINT)
	{
		*reg = 0b00000101; // enable handshake and transmit
	}
	else if (type == OUT_ENDPOINT)
	{
		*reg = 0b00001001; // enable handshake and receive
	}
	else if (type == CONTROL_ENDPOINT)
	{
		// Bidirectional control endpoint.
		*reg = 0b00001101; // enable handshake, transmit and receive
	}
	else
	{
		usbFatalError();
	}
}

/** Query whether an endpoint is enabled.
  * \return false if the endpoint is disabled, true if it is enabled.
  */
bool usbIsEndpointEnabled(unsigned int endpoint)
{
	if (endpoint >= NUM_ENDPOINTS)
	{
		// Bad endpoint number.
		usbFatalError();
		return false;
	}
	if (endpoint_states[endpoint] == NULL)
	{
		return false;
	}
	else
	{
		return true;
	}
}

/** Queue a packet for transmission. This is non-blocking; it will return
  * immediately, probably having not done any actual transmission. When the
  * packet has actually been transmitted, the transmitCallback function of the
  * endpoint state (see #EndpointState) will be called.
  * \param packet_buffer Address of persistent packet data to transmit.
  * \param length Number of bytes to transmit.
  * \param endpoint The endpoint number of the transmission.
  * \param is_extended Whether to do an extended transmission or
  *                    not. A large (>= #MAX_PACKET_SIZE) extended
  *                    transmission may be split up into multiple packets, as
  *                    described in section 5.5.3 of the USB specification.
  *                    If you're confused over whether to do an extended
  *                    transmit or not, ask the question: is this for the Data
  *                    stage of a control transfer? If not, you probably don't
  *                    need to do an extended transmit.
  * \warning Since this is non-blocking, the data specified by packet_buffer
  *          must persist until the transmitCallback function is called.
  */
void usbQueueTransmitPacket(const uint8_t *packet_buffer, uint32_t length, unsigned int endpoint, bool is_extended)
{
	unsigned int index;

	if (endpoint >= NUM_ENDPOINTS)
	{
		// Bad endpoint number.
		usbFatalError();
		return;
	}
	index = BDT_IDX(endpoint, BDT_TX, BDT_EVEN);
	if (bdt_table[index].CTRL.UOWN != 0)
	{
		// Attempting to overwrite another queued transmission.
		usbFatalError();
		return;
	}
	if (endpoint_states[endpoint] == NULL)
	{
		// Attempting to transmit from a disabled endpoint.
		usbFatalError();
		return;
	}
	endpoint_states[endpoint]->transmit_remaining = length;
	endpoint_states[endpoint]->transmit_buffer = packet_buffer;
	if (length < MAX_PACKET_SIZE)
	{
		// Data will fit entirely in one packet (with room to spare), so it
		// is never necessary to do an extended transmit.
		endpoint_states[endpoint]->is_extended_transmit = false;
	}
	else if (length == MAX_PACKET_SIZE)
	{
		// Data will fit entirely in one packet. However, if this is part of
		// an extended transmit, an extra zero-length packet needs to be sent,
		// in order to notify the other end that there is no more data. See
		// section 8.5.3.2 of the USB specification.
		endpoint_states[endpoint]->is_extended_transmit = is_extended;
	}
	else if (length > MAX_PACKET_SIZE)
	{
		// Data will not fit entirely in one packet.
		if (is_extended)
		{
			// Split packet into MAX_PACKET_SIZE sized chunks.
			endpoint_states[endpoint]->is_extended_transmit = true;
			length = MAX_PACKET_SIZE;
		}
		else
		{
			// Tried to send a packet which is too big.
			usbFatalError();
		}
	}
	// Set buffer parameters.
	bdt_table[index].CTRL.BSTALL = 0;
	bdt_table[index].CTRL.DTS = 0;
	bdt_table[index].CTRL.NINC = 0;
	bdt_table[index].CTRL.KEEP = 0;
	bdt_table[index].CTRL.DATA0_1 = endpoint_states[endpoint]->data_sequence;
	bdt_table[index].CTRL.BYTE_COUNT = length;
	bdt_table[index].CTRL.BUFFER_ADDRESS = VIRTUAL_TO_PHYSICAL(packet_buffer);
	// Tell USB module to process buffer.
	bdt_table[index].CTRL.UOWN = 1;
}

/** Cancel a queued transmission.
  * \param endpoint The endpoint number of the transmission to cancel.
  * \warning It is almost always unsafe to call this, because the USB module
  *          operates asynchronously and independently of the CPU. There is
  *          only one time when it is safe: during the Setup stage of a
  *          control transfer.
  */
void usbCancelTransmit(unsigned int endpoint)
{
	unsigned int index;

	if (U1CONbits.PKTDIS == 0)
	{
		// Unsafe situation; the transmit could be in progress.
		usbFatalError();
	}
	if (endpoint >= NUM_ENDPOINTS)
	{
		// Bad endpoint number.
		usbFatalError();
		return;
	}
	index = BDT_IDX(endpoint, BDT_TX, BDT_EVEN);
	if (bdt_table[index].CTRL.UOWN == 0)
	{
		// Try to cancel non-existent transmit.
		usbFatalError();
	}
	bdt_table[index].CTRL.UOWN = 0;
}

/** Stall an endpoint. If the host tries to transact with a stalled endpoint,
  * it will get a stall handshake. This is useful for issuing a control
  * transfer protocol stall (see section 8.5.4.3 of the USB specification).
  * Note that SETUP tokens will automatically unstall an endpoint.
  * \param endpoint The endpoint number of the endpoint to stall.
  */
void usbStallEndpoint(unsigned int endpoint)
{
	volatile uint32_t *reg;

	if (endpoint >= NUM_ENDPOINTS)
	{
		// Bad endpoint number.
		usbFatalError();
		return;
	}
	reg = getEndpointControlRegister(endpoint);
	*reg |= 0x02; // set EPSTALL bit
}

/** Unstall an endpoint. This will clear the stall status of an endpoint
  * previously stalled with usbStallEndpoint().
  * \param endpoint The endpoint number of the endpoint to unstall.
  */
void usbUnstallEndpoint(unsigned int endpoint)
{
	volatile uint32_t *reg;

	if (endpoint >= NUM_ENDPOINTS)
	{
		// Bad endpoint number.
		usbFatalError();
		return;
	}
	reg = getEndpointControlRegister(endpoint);
	*reg &= ~0x02; // clear EPSTALL bit
}

