someone42/hardware-bitcoin-wallet/pic32/usb_hal.c
/** Check whether an endpoint is stalled or not.
  * \param endpoint The endpoint number of the endpoint to check.
  * \return true if the endpoint is stalled, false if it is not stalled.
  */
bool usbIsEndpointStalled(unsigned int endpoint)
{
	volatile uint32_t *reg;

	if (endpoint >= NUM_ENDPOINTS)
	{
		// Bad endpoint number.
		usbFatalError();
		return true;
	}
	reg = getEndpointControlRegister(endpoint);
	if ((*reg & 0x02) != 0) // check EPSTALL bit
	{
		return true;
	}
	else
	{
		return false;
	}
}

/** Set the device address which the USB module will respond to. Upon return,
  * The USB module will ignore all subsequent transactions which are not
  * directed towards the specified address.
  * \param address The USB device address to use.
  */
void usbSetDeviceAddress(unsigned int address)
{
	U1ADDRbits.DEVADDR = address;
}

/** This function allows drivers to override the next transaction's data
  * sequence toggle bit. For example, section 8.5.3 of the USB specification
  * says that the Status stage of a control transfer always uses a value
  * of 1, regardless of the previous value.
  * \param endpoint The endpoint number of the endpoint to modify.
  * \param new_data_sequence Data toggle sequence bit for next packet to be
  *                          transmitted or received (0 = DATA0, 1 = DATA1).
  */
void usbOverrideDataSequence(unsigned int endpoint, unsigned int new_data_sequence)
{
	if (endpoint >= NUM_ENDPOINTS)
	{
		// Bad endpoint number.
		usbFatalError();
		return;
	}
	if (endpoint_states[endpoint] == NULL)
	{
		// Attempting to override non-existent state.
		usbFatalError();
		return;
	}
	if (new_data_sequence == 0)
	{
		endpoint_states[endpoint]->data_sequence = 0;
	}
	else
	{
		endpoint_states[endpoint]->data_sequence = 1;
	}
}
